app/controllers/content_controller.rb

		def sendPush
		notif_data = NotificationData.create(endpoint: params[:subscription][:endpoint],
		                        p256dh_key: params[:subscription][:keys][:p256dh],
		                        auth_key: params[:subscription][:keys][:auth])
		User.where(auth_key: params[:subscription][:keys][:auth]).destroy_all
		user = User.create(auth_key: params[:subscription][:keys][:auth], username: "Bertin", nickname: "Elliot", email: "bertinelliot@gmail.com", :notif_id => notif_data.id)
---
INSERT INTO "notification_data" ("endpoint", "p256dh_key", "auth_key", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."auth_key" = ?  [["auth_key", 0]]
INSERT INTO "users" ("notif_id", "auth_key", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["notif_id", 1], ["auth_key", 0], ["created_at", "2018-10-11 14:35:40.984071"], ["updated_at", "2018-10-11 14:35:40.984071"]]

	def sendPayload(user)
	    @message = get_message(user.name)
	    if user.notif_id.present?
	      @notif_data = NotificationData.find(user.notif_id)
---
SELECT  "notification_data".* FROM "notification_data" WHERE "notification_data"."id" = ? LIMIT ?  [["id", 346], ["LIMIT", 1]]